blog-app/app/controllers/api/v1/articles_controller.rb

  def index
    articles = Article.all.includes(:comments, :attentions, :user,:tags)
    render json: articles, each_serializer: Article::IndexSerializer, meta: { total: articles.count, limit: 10 }
---
SELECT `articles`.* FROM `articles`
SELECT `attentions`.* FROM `attentions` WHERE `attentions`.`article_id` IN (2, 3)
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` IN (2, 3)
SELECT `tags`.* FROM `tags` WHERE `tags`.`id` IN (19, 20, 21, 22)
SELECT COUNT(*) AS count_all, blog.articles.id AS blog_articles_id FROM `attentions` LEFT JOIN blog.attentions ON blog.attentions.article_id = blog.articles.id AND isliked = 1 WHERE `attentions`.`article_id` = 10 GROUP BY blog.articles.id
SELECT COUNT(*) FROM `comments` WHERE `comments`.`article_id` = 10

  def create
    binding.pry
    if current_user
      article = Article.create title: params[:title], content:params[:content],
      title_image: params[:title_image]  , category_id: params[:category_id], user_id: current_user.id
      # params[:article][:titletle_image].original_filename = rename_file params[:article][:title_image].original_filename
      article.save
      @tags= params[:tags]
      @tags.split(',').each do |f|
      @tag= Tag.find_or_create_by(name: f)
      article.articles_tags.create(tag_id: @tag.id)
---
INSERT INTO `articles` (`title`, `content`, `title_image`, `user_id`, `category_id`, `created_at`, `updated_at`, `deleted`, `slug`) VALUES ('Test with Rspec', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.', 'hotgirl.jpg', 1, 1, '2017-05-23 16:10:11', '2017-05-23 16:10:11', 0, 'test-with-rspec')
UPDATE `articles` SET `user_id` = 1 WHERE `articles`.`id` = 20
INSERT INTO `tags` (`name`) VALUES ('tag2')
SELECT  `tags`.* FROM `tags` WHERE `tags`.`name` = 'test' LIMIT 1
INSERT INTO `articles_tags` (`article_id`, `tag_id`) VALUES (6, 10)

    def update
      binding.pry
    if current_user
      article = Article.friendly.find(params[:id])
      if article.update title: params[:title], content:params[:content],
      title_image: params[:title_image]  , category_id: params[:category_id], user_id: current_user.id
            article.save
            @tags= params[:tags].split(',')
            articles_tags = article.tags.map{ |tag| tag.name }
            (@tags - articles_tags).each do |f|
              binding.pry
              if f.present?
                @tag = Tag.find_or_create_by(name: f)
                article.articles_tags.create(tag_id: @tag.id)
              end
            end
            (articles_tags - @tags).each do |f|
              if f.present?
                @tag = Tag.find_by(name: f)
                article.articles_tags.find_by(tag_id: @tag.id).destroy
---
UPDATE `articles` SET `title` = 'Lorem ABCDEFGH', `content` = 'Suc khoe', `title_image` = 'anhcho.jpg', `user_id` = 1, `updated_at` = '2017-05-26 09:37:34' WHERE `articles`.`id` = 22
SELECT `tags`.* FROM `tags` INNER JOIN `articles_tags` ON `tags`.`id` = `articles_tags`.`tag_id` WHERE `articles_tags`.`article_id` = 2
INSERT INTO `tags` (`name`) VALUES ('test')
INSERT INTO `articles_tags` (`article_id`, `tag_id`) VALUES (9, 16)
DELETE FROM `articles_tags` WHERE `articles_tags`.`id` = 2
SELECT  `articles_tags`.* FROM `articles_tags` WHERE `articles_tags`.`article_id` = 2 AND `articles_tags`.`tag_id` = 3 LIMIT 1

    def destroy
      if current_user.present?
       article = Article.find(params[:id])
       article.update_columns deleted: true
---
UPDATE `articles` SET `articles`.`deleted` = 1 WHERE `articles`.`id` = 1