blog-app/app/controllers/api/v1/attentions_controller.rb

SELECT  `attentions`.* FROM `attentions` WHERE `attentions`.`user_id` = 1 AND `attentions`.`article_id` = 1 LIMIT 1
SELECT `attentions`.* FROM `attentions`
UPDATE `attentions` SET `isFollowed` = 1 WHERE `attentions`.`id` = 2
INSERT INTO `attentions` (`article_id`, `user_id`, `isFollowed`, `notification_follow`) VALUES (1, 1, 1, 1)
---
  def index
    #Like button response.request.env["HTTP_ACCESS_TOKEN"]
    user = check_login
    if !user.blank?
      attention = Attention.find_by user_id: user.id, article_id: params[:article_id]
      if !attention.blank?
        attention.update isLiked: attention.isLiked ? false : true if !params[:isLiked].blank?
        attention.update isFollowed: attention.isFollowed ? false : true if !params[:isFollowed].blank?
      else
        Attention.create user_id: user.id, article_id: params[:article_id], isLiked: true, notification_like: true if !params[:isLiked].blank?