blog-app/app/controllers/api/v1/authorizations_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'nhuy387@gmail.com' LIMIT 1
UPDATE `users` SET `access_token` = '94906378281d48d6e6d6319ecd7926f714950283033', `avatar` = '3.jpg', `updated_at` = '2017-05-17 15:18:44' WHERE `users`.`id` = 3
---
  def create
    user = User.find_by(email: params[:email])
    if user.blank?
      render json: { errors: ['Not match email']}, status: :unauthorized
    else
      if user.authenticate(params[:password]).blank?
        render json: { errors: ['Not match password']}, meta: {status: 400 }
      else
        token = SecureRandom.hex
        binding.pry
        user.access_token = token
        user.update_attribute("access_token", token)

UPDATE `users` SET `password_digest` = '$2a$10$n/UkmtZN66snUuAC4Q5zNeKDDIkwy9B84WJIu519xIJUahP4BZY.i', `updated_at` = '2017-05-16 08:54:42' WHERE `users`.`id` = 102
---
  def update
    user = check_login response.request.env["HTTP_ID"], response.request.env["HTTP_ACCESS_TOKEN"]
    if !user.blank?
      if user.authenticate(params[:password_old])
        user.password = params[:password_new]
        user.save!

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `access_token` = NULL, `updated_at` = '2017-05-18 02:50:19' WHERE `users`.`id` = 3
---
  def destroy
    if (check_login params[:id], params[:access_token] != nil) && (!check_time_access params[:id])
      User.find(params[:id]).update_columns(access_token: nil)