blog-app/app/controllers/api/v1/categories_controller.rb

  def index
    render json: Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    if current_user.present?
      if current_user.access
        category = Category.create name: params[:category][:name]
---
INSERT INTO `categories` (`name`) VALUES ('Travel')

  def update
    if current_user.present?
      if current_user.access
        category = Category.find params[:id]
        category.name = params[:category][:name]
        if category.save
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `name` = 'Travell' WHERE `categories`.`id` = 1

  def destroy
    if current_user.present?
      if current_user.access
        category = Category.find params[:id]
        category.deleted = true
        if category.save
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `deleted` = 1 WHERE `categories`.`id` = 1