blog-app/app/controllers/api/v1/comments_controller.rb

  def create
    @article = Article.find_by_slug!(params[:article_slug])
    if current_user
      comment = Comment.new(comment_params)
      comment.user_id = current_user.id
      comment.article_id = @article.id
      comment.save
---
INSERT INTO `comments` (`user_id`, `article_id`, `content`, `created_at`, `updated_at`) VALUES (1, 1, 'Very Good', '2017-05-23', '2017-05-23')

  def update
    @article = Article.find_by_slug!(params[:article_slug])
    if current_user
      comment = Comment.find(params[:id])
      comment.update(comment_params)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
UPDATE `comments` SET `content` = 'Hay lam ', `updated_at` = '2017-05-23 14:21:43' WHERE `comments`.`id` = 2

  def destroy

      if current_user.present?
       comment = Comment.find(params[:id])
       comment.destroy
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1