blog-app/app/controllers/api/v1/followers_controller.rb

  def create
    if current_user.present?
      follower = FollowUser.find_by user_id: params[:user_id], be_followed_id: current_user.id
      if follower.blank?
        #be_followed_id is people go follow orther people (current_user)
        follow_user = FollowUser.create user_id: params[:user_id], be_followed_id: current_user.id
        message = "<span class='notifice'>#{ current_user.username }</span> started following you"
        follow_user.notifications.create user_id: params[:user_id], message: message
      else
        follower.destroy
---
SELECT  `follow_users`.* FROM `follow_users` WHERE `follow_users`.`user_id` = 1 AND `follow_users`.`be_followed_id` = 2 LIMIT 1
INSERT INTO `follow_users` (`user_id`, `be_followed_id`) VALUES (1, 2)
INSERT INTO `notifications` (`notificationable_id`, `notificationable_type`, `user_id`, `message`) VALUES (2, 'FollowUser', 1, '<span class=\'notifice\'>Hiep-Hiep</span> started following your article')
DELETE FROM `follow_users` WHERE `follow_users`.`id` = 2