blog-app/app/controllers/api/v1/follows_controller.rb

  def show
    if current_user.present?
      #Check user followed this article? If not yet then create new, opposite
      attention = Attention.find_by article_id: params[:id], user_id: current_user.id, isFollowed: 1
      if attention.blank?
        attention = Attention.create article_id: params[:id], user_id: current_user.id, isFollowed: 1
        article = Article.find(params[:id])
        message = "#{ current_user.username } followed your #{ article.title }"
        attention.notifications.create user_id: article.user_id, message: message, image: article.title_image
      else
        attention.destroy
---
INSERT INTO `attentions` (`article_id`, `user_id`, `types`) VALUES (1, 2, 0)
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `notifications` (`notificationable_id`, `notificationable_type`, `user_id`, `message`) VALUES (21, 'Attention', 1, '<span class=\'notifice\'>Hiep-Hiep</span> followed your article')
DELETE FROM `attentions` WHERE `attentions`.`id` = 20
DELETE FROM `notifications` WHERE `notifications`.`id` = 16