blog-app/app/controllers/api/v1/followers_controller.rb

  def index
    user = check_login
    if !user.blank?
      #Check user did follow this people
      isFollowed = FollowUser.find_by user_id: params[:id], be_followed_id: user.id
      FollowUser.create user_id: params[:id], be_followed_id: user.id if isFollowed.blank?
---
SELECT  `follow_users`.* FROM `follow_users` WHERE `follow_users`.`user_id` = 2 AND `follow_users`.`be_followed_id` = 1 LIMIT 1
INSERT INTO `follow_users` (`user_id`, `be_followed_id`, `isChecked`) VALUES (2, 1, 1)

  def destroy
    user = check_login
    if !user.blank?
      follower = FollowUser.find_by user_id: params[:id], be_followed_id: user.id
      follower.destroy if !follower.blank?
---
SELECT  `follow_users`.* FROM `follow_users` WHERE `follow_users`.`user_id` = 2 AND `follow_users`.`be_followed_id` = 1 LIMIT 1
DELETE FROM `follow_users` WHERE `follow_users`.`id` = 1