blog-app/app/controllers/api/v1/likes_controller.rb

INSERT INTO `attentions` (`article_id`, `user_id`) VALUES (1, 2)
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `notifications` (`notificationable_id`, `notificationable_type`, `user_id`, `message`) VALUES (23, 'Attention', 1, '<span class=\'notifice\'>Hiep-Hiep</span> liked your post <b> hihi</b>')
DELETE FROM `attentions` WHERE `attentions`.`id` = 18
DELETE FROM `notifications` WHERE `notifications`.`id` = 15
---
  def show
    if current_user.present?
      #Check user liked this article? If not yet then create new, opposite
      attention = Attention.find_by article_id: params[:id], user_id: current_user.id, isLiked: 1
      if attention.blank?
        attention = Attention.create article_id: params[:id], user_id: current_user.id, isLiked: 1
        message = "#{ current_user.username } liked your post #{ attention.article.content[0..10] }"
        article = Article.find(params[:id])
        attention.notifications.create user_id: article.user_id, message: message, image: article.title_image
      else
        attention.destroy