blog-app/app/controllers/api/v1/tags_controller.rb

	def index
		render json: tags = Tag.all
---
SELECT `tags`.* FROM `tags`

	def show
		render json: tag = Tag.find(params[:id])
---
SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1