blog-app/app/controllers/api/v1/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    user = User.find(params[:id])

INSERT INTO `users` (`username`, `email`, `avatar`, `password_digest`, `access_token`, `confirm_token`, `created_at`, `updated_at`) VALUES ('Ms. Aiden Medhurst', 'kallie@kiehn.info', 'http://localhost:3000/uploads/avatar/default-avatar.png', '$2a$04$Ie65i/5nenYJb0ZfiiJ8.OIbzWb13yl.0iWQHvvHdfz5u1gWxvR9O', '1134b79d6b142d8da78865b972bceff30', 'F5rfEwOctqDuPO90ZeCaLw', '2017-05-23 17:55:19', '2017-05-23 17:55:19')
---
  def create
    @user = User.new user_params
    if @user.valid?
      token = SecureRandom.hex  + @user.created_at.to_i.to_s + @user.id.to_s

UPDATE `users` SET `fullname` = 'Huy Huy', `username` = 'sleep1511', `description` = 'description myseft', `updated_at` = '2017-05-17 08:37:22' WHERE `users`.`id` = 1
---
  def update
    if @current_user.present?
      #Handle rename filename uploaded to user_id.typefile
      params[:user][:avatar].original_filename = rename_file params[:user][:avatar].original_filename, @current_user.id
      @current_user.fullname = params[:user][:fullname]
      @current_user.description = params[:user][:description]
      @current_user.birthday = params[:user][:birthday]
      binding.pry
      @current_user.avatar = "/uploads/avatar/"+ params[:user][:avatar].original_filename
      if @current_user.valid?
        @current_user.save